{
  "title": "What Makes Airbnb, Airbnb",
  "subtitle": "Pronunciation Shadowing Segments",
  "segments": [
    {
      "sentences": [
        "Thirteen years ago, Joe, Nate, and I created a company that many thought was an unlikely idea to work.",
        "As we take our company public, we want to share what makes Airbnb, Airbnb."
      ]
    },
    {
      "sentences": [
        "We began writing this letter in March.",
        "Then the pandemic hit, borders closed, travel stopped, and our business declined by nearly 80%."
      ]
    },
    {
      "sentences": [
        "We had to put our IPO on hold, and some people questioned whether we would make it.",
        "What followed became our most defining period since starting Airbnb."
      ]
    },
    {
      "sentences": [
        "They say a crisis reveals your true character.",
        "We want to share what this crisis revealed about who we are."
      ]
    },
    {
      "sentences": [
        "First, our model is inherently adaptable.",
        "After months indoors, people wanted safe ways to connect and chose trips closer to home, often to small towns and rural communities."
      ]
    },
    {
      "sentences": [
        "Because millions of hosts offer nearly all types of homes and experiences worldwide, we could adapt to new use cases guests wanted.",
        "From working remotely in another home to taking extended family trips, our business rebounded faster than expected."
      ]
    },
    {
      "sentences": [
        "This showed that as the world changes, our model can adapt.",
        "The crisis also reinforced three truths core to who we are and how we will operate."
      ]
    },
    {
      "sentences": [
        "The first truth is connection and belonging.",
        "When we started Airbnb, it was always about more than just travel."
      ]
    },
    {
      "sentences": [
        "In 2007, Joe and I inflated three airbeds during a sold‑out design conference and hosted Michael, Kat, and Amol.",
        "They arrived as strangers but left as friends."
      ]
    },
    {
      "sentences": [
        "Those connections sparked the bigger idea, and Nate soon joined us.",
        "We created a way for people everywhere to be hosts, just like us."
      ]
    },
    {
      "sentences": [
        "We grew from two hosts in San Francisco to a community of over four million hosts around the world.",
        "People come to Airbnb for a new way to travel, but they find a deeper connection beneath the surface."
      ]
    },
    {
      "sentences": [
        "Hosts deliver that connection through deeply personal experiences.",
        "Guests are welcomed into real homes and real communities."
      ]
    },
    {
      "sentences": [
        "When the pandemic hit, we couldn’t pursue everything we used to.",
        "We focused on our core business of hosting and the everyday people who make it special."
      ]
    },
    {
      "sentences": [
        "We scaled back investments that did not directly support our host community.",
        "This focus arrived at the right time."
      ]
    },
    {
      "sentences": [
        "People feel increasingly disconnected, and loneliness is spreading.",
        "The opposite of loneliness is belonging — the feeling of being at home, known, and loved."
      ]
    },
    {
      "sentences": [
        "We are a community based on connection and belonging, and we will keep designing new ways to provide it.",
        "We believe we have only scratched the surface."
      ]
    },
    {
      "sentences": [
        "We will focus on connection and belonging.",
        "We will prioritize the individual hosts who deliver it and invest in building our community."
      ]
    },
    {
      "sentences": [
        "As the world changes, the need for connection and belonging will not.",
        "This will remain our focus."
      ]
    },
    {
      "sentences": [
        "The second truth is that we are creatively‑led.",
        "Airbnb was born with a creative spirit, shaped by our time at the Rhode Island School of Design."
      ]
    },
    {
      "sentences": [
        "We use curiosity and imagination to find unconventional solutions.",
        "Starting Airbnb was itself a creative leap."
      ]
    },
    {
      "sentences": [
        "We are dreamers, but also pragmatic.",
        "At the center of being creatively‑led is our design‑driven approach."
      ]
    },
    {
      "sentences": [
        "At Airbnb, design is not just how something looks; it is how it works.",
        "We sit at the intersection of art and science, a commitment that began when Nate, an engineer, joined us."
      ]
    },
    {
      "sentences": [
        "This approach helped us design a system of trust for strangers to live together.",
        "It also enabled a unique business model that lets hosts share in our success."
      ]
    },
    {
      "sentences": [
        "Our approach will keep enabling us to create products and services that deliver connection beyond travel.",
        "Constraints breed creativity, and the crisis drew on this strength repeatedly."
      ]
    },
    {
      "sentences": [
        "When social distancing began, we paused in‑person Experiences.",
        "Within two weeks, we pivoted to Online Experiences that connect people worldwide."
      ]
    },
    {
      "sentences": [
        "As we prepared to go public, we sought a new way for hosts to continue sharing in our success.",
        "We created the Airbnb Host Endowment, seeded with over nine million shares of company stock."
      ]
    },
    {
      "sentences": [
        "These are just two of many creative solutions the crisis inspired.",
        "Our creativity will help us keep designing new possibilities for people."
      ]
    },
    {
      "sentences": [
        "We will use curiosity and imagination to create unconventional solutions.",
        "We will keep a unique, design‑driven approach and ensure creative people have a seat at the table."
      ]
    },
    {
      "sentences": [
        "Being creatively‑led is core to who we are and how we run Airbnb.",
        "The third truth is our responsibility to our stakeholders."
      ]
    },
    {
      "sentences": [
        "Airbnb balances five stakeholders: guests, hosts, communities, employees, and shareholders.",
        "In 2018, we defined principles to serve each stakeholder, and the crisis put them to the ultimate test."
      ]
    },
    {
      "sentences": [
        "When travel stopped, guests needed to cancel many non‑refundable reservations.",
        "Guided by our extenuating circumstances policy, we issued more than $1 billion in refunds."
      ]
    },
    {
      "sentences": [
        "This helped guests but created problems for hosts, half of whom rely on Airbnb income for rent or mortgages.",
        "We committed up to $250 million to support hosts impacted by cancellations."
      ]
    },
    {
      "sentences": [
        "To protect shareholders, we significantly reduced expenses and raised $2 billion in debt.",
        "When we faced layoffs, we treated every employee with respect and compassion."
      ]
    },
    {
      "sentences": [
        "We partnered with thousands of hosts to offer homes to frontline workers.",
        "We reject the notion that serving one stakeholder means taking from another."
      ]
    },
    {
      "sentences": [
        "In the long run, with creativity, we can design win‑wins for all stakeholders.",
        "We will design for the long‑term benefit of each stakeholder and measure our progress."
      ]
    },
    {
      "sentences": [
        "We will adjust when we do not get it right.",
        "Our stakeholder responsibility will continue to guide how we operate."
      ]
    },
    {
      "sentences": [
        "At the core of Airbnb are three ideas.",
        "Our community is based on connection and belonging, our creativity imagines new possibilities, and our responsibility extends to all stakeholders."
      ]
    },
    {
      "sentences": [
        "These ideas share a belief that people are good and that we are in this together.",
        "This is what makes Airbnb, Airbnb."
      ]
    },
    {
      "sentences": [
        "A crisis brings clarity about what truly matters.",
        "We are thankful for everyone who stood by us during our darkest hours."
      ]
    },
    {
      "sentences": [
        "Thank you to our employees for tireless work and personal sacrifice.",
        "Thank you to our investors for believing strangers could live together and for sticking with us."
      ]
    },
    {
      "sentences": [
        "Thank you to our hosts and guests, without whom we would not exist.",
        "You have proven that people can trust one another."
      ]
    },
    {
      "sentences": [
        "Finally, I thank Joe and Nate for being the best partners I could ask for.",
        "Some asked if this was the end of Airbnb, but it was just the beginning."
      ]
    },
    {
      "sentences": [
        "It is still early, and we invite you to join us on this journey.",
        "This is our story of resilience, connection, and responsibility."
      ]
    }
  ]
}
